app/Controllers/Film.php

            'duration'=> $this->request->getPost("duration"),
            'cover'=> $imageName,
        ];
        $this->Film->save($data);
---
INSERT INTO `film` (`nama_film`, `id_genre`, `duration`, `cover`) VALUES ('Detektif jaga jarak', '5', ' 2 jam ', '1687318970_7b28009e4c3d0a600519.jpg')

         }

         //ambil data lama
         $semuaFilm = $this->Film->find($this->request->getPost('id'));
---
SELECT *
FROM `film`
WHERE `film`.`id` = '1'

        $data['cover'] = $imageName;
        }

         $this->Film->save($data);
---
UPDATE `film` SET `nama_film` = 'Tom and jerri', `id_genre` = '1', `duration` = '   1 jam 20 menit'
WHERE `film`.`id` IN ('1')