app/Controllers/Genre.php

UPDATE `genre` SET `nama_genre` = 'kaktus'
WHERE `genre`.`id_genre` IN ('1')
---
    public function edit_genre()
    {
        $validation = $this->validate([
            'nama_genre' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Kolom Nama Genre harus diisi'
                ]
            ]
        ]);

        if (!$validation) {
            $errors = \Config\Services::validation()->getErrors();
            return redirect()->back()->withInput()->with('errors', $errors);
        }

        $id_genre = $this->request->getPost('id_genre');
        $data = [
            'nama_genre' => $this->request->getPost('nama_genre'),
        ];

        $this->Genre->update($id_genre, $data);

DELETE FROM `genre`
WHERE `id_genre` IN ('12')
---
public function hapus($id_genre)
{
    $decryptedId = decryptUrl($id_genre);
    $this->Genre->delete($decryptedId);